{
  "personal_info": {
    "name": "Muhammed Said Altan",
    "location": "Ottawa, ON, Canada",
    "email": "altansaid13@outlook.com",
    "portfolio": "https://saidaltan.com",
    "github": "https://github.com/altansaid",
    "linkedin": "https://linkedin.com/in/saidaltan"
  },

  "education": [
    {
      "degree": "Diploma in Web Development and Internet Applications",
      "school": "Algonquin College",
      "location": "Ottawa, Canada",
      "graduation_date": "2025-04"
    }
  ],

  "experience": [
    {
      "type": "internship",
      "title": "Web Developer Intern",
      "company": "Solace",
      "location": "Ottawa, Canada",
      "start_date": "2024-09",
      "end_date": "2024-12",
      "achievements": [
        "Developed and deployed a reusable JavaScript/jQuery Table of Contents plugin integrated into enterprise knowledge bases, improving navigation speed and reducing bounce rate by 42%.",
        "Improved SEO performance and accessibility by addressing Lighthouse audit findings, raising performance and accessibility scores to consistently exceed 90+ benchmarks.",
        "Built an internal employee engagement microsite using PHP, REST APIs, and Bootstrap, increasing participation by 50% and enabling modular content reuse across departments.",
        "Resolved Node.js environment mismatch issues in CI/CD pipeline, reducing build and deployment failures by 80%.",
        "Integrated RESTful services with frontend components, emphasizing scalability, performance, and secure coding practices.",
        "Collaborated in Agile sprints, participating in backlog grooming, peer reviews, and CI/CD workflows to ensure maintainability and quality.",
        "Enhanced UI/UX using Figma, Adobe Photoshop, and Illustrator, improving visual consistency across internal sites."
      ],
      "technologies": [
        "WordPress",
        "PHP",
        "JavaScript",
        "jQuery",
        "Node.js",
        "React",
        "Gatsby",
        "Bootstrap",
        "SEO",
        "Lighthouse",
        "Agile",
        "Jira",
        "REST APIs",
        "Figma",
        "Adobe Photoshop",
        "Adobe Illustrator"
      ]
    },
    {
  "type": "experience",
  "title": "Software Developer",
  "company": "Arbithub Cyclops",
  "location": "Remote",
  "start_date": "2025-07",
  "end_date": "Present",
  "achievements": [
    "Contributed to a SaaS platform designed to automate profitable product discovery and ROI analysis across major online marketplaces using real-time Amazon product data.",
    "Assisted in developing and maintaining a full-stack architecture combining React, Node.js, Go, and Firebase, supporting thousands of daily product analyses.",
    "Improved Firestore query performance and indexing, achieving up to 70% faster response times for product analytics and filtering operations.",
    "Collaborated on the integration of Amazon’s Selling Partner API (SP-API) and Keepa API, enabling real-time FBA fee, sales rank, and pricing data retrieval with 95%+ profit calculation accuracy.",
    "Contributed to concurrent data scraping modules written in Go, processing 500–1000 products per hour with anti-bot detection bypass and exponential retry logic.",
    "Enhanced the frontend experience by implementing pagination, debounced search, and lazy loading—improving large dataset handling efficiency by over 60%.",
    "Integrated OpenAI GPT-3.5-based pack normalization, increasing matching accuracy across product variations and ensuring consistency in profit calculations.",
    "Participated in the development of RESTful API connections and microservice communication, ensuring stable and scalable backend performance.",
    "Supported Stripe-based subscription management workflows, enabling automated 7-day trials, renewals, and secure payment validation.",
    "Helped design an analytics dashboard displaying real-time metrics such as profit ratio, sales velocity, and competitor count, improving user decision-making speed.",
    "Assisted in implementing Firebase Authentication and protected routes, securing access to premium features and reducing unauthorized API calls.",
    "Worked on the integration of monitoring tools (Google Analytics, Microsoft Clarity) to track user behavior and inform UI/UX enhancements.",
    "Contributed to team code reviews and Git branch management, maintaining clean version control and consistent ESLint/Prettier standards.",
    "Supported internationalization setup (i18next) for multilingual interface support, expanding platform accessibility to global users.",
    "Collaborated in Agile sprints, focusing on feature debugging, microservice deployment, and continuous improvement across modules."
  ],
  "technologies": [
    "React",
    "Redux",
    "Node.js",
    "Express.js",
    "Go",
    "Firebase",
    "Firestore",
    "Google Cloud Run",
    "OpenAI GPT-3.5",
    "Amazon SP-API",
    "Keepa API",
    "Stripe API",
    "SendGrid",
    "Tailwind CSS",
    "Bootstrap",
    "i18next",
    "Axios",
    "Docker",
    "ESLint",
    "Prettier",
    "Git",
    "Agile"
  ],
  "link": "https://arbitragecyclops.com/"
},

    {
      "type": "capstone",
      "title": "Capstone Project Developer",
      "company": "BodyBliss",
      "location": "Ottawa, Canada",
      "start_date": "2024-01",
      "end_date": "2024-04",
      "achievements": [
        "Delivered a production-ready client website with custom responsive UI using Laravel and Livewire.",
        "Collaborated directly with client to gather requirements, iterate on designs, and deploy final solution with CMS features."
      ],
      "technologies": ["Laravel", "Livewire", "HTML", "CSS", "JavaScript", "CMS"]
    }
  ],

  "projects": [
    {
      "name": "PLAB2 Practice Platform",
      "summary_short": "Built a full-stack real-time PLAB2 practice app with React, Spring Boot, and WebSockets for 500+ users.",
      "link": "https://plab2practice.com",
      "repository": "https://github.com/altansaid/plab2projectnew",
      "description": "Real-time collaborative platform for medical exam preparation with role-based sessions and feedback.",
      "achievements": [
        "Developed real-time collaborative platform for PLAB 2 exam preparation with Doctor, Patient, and Observer roles.",
        "Implemented session features: timed consultations, randomized cases, and feedback workflows.",
        "Built JWT-secured authentication and role-based access control with Spring Security.",
        "Designed modular Spring Boot RESTful microservices with 60+ API endpoints.",
        "Implemented WebSockets (STOMP) for real-time sync across users under 200ms latency.",
        "Optimized scalability using PostgreSQL, Flyway migrations, and Dockerized deployments.",
        "Deployed backend on Render and frontend on Vercel with custom domain plab2practice.com.",
        "Developed accessible frontend using React, TypeScript, Tailwind CSS, and Material UI.",
        "Supported 500+ active users in cloud-ready production environment."
      ],
      "technologies": [
        "Spring Boot",
        "Java",
        "React",
        "TypeScript",
        "PostgreSQL",
        "Supabase",
        "WebSocket",
        "Docker",
        "Render",
        "Vercel"
      ]
    },
    {
      "name": "Interview Coach AI",
      "summary_short": "MERN-based AI interview prep platform using Gemini API, JWT, and Google OAuth.",
      "link": "https://interviewcoach-ai.vercel.app/",
      "repository": "https://github.com/altansaid/interviewcoach-ai",
      "description": "AI-powered interview preparation app generating tailored questions with pinning and explanation features.",
      "achievements": [
        "Developed cloud-native MERN platform integrating Google’s Gemini AI for generating personalized interview questions.",
        "Implemented secure authentication with JWT, Google OAuth, bcrypt, and password reset via email.",
        "Built fully modal-based Forgot Password flow for seamless UX.",
        "Created note-taking, pinning, and progress-tracking features for candidates.",
        "Developed RESTful API with MVC architecture and structured routes.",
        "Enabled image upload and secure file handling using Multer.",
        "Enhanced reliability with CI/CD pipelines, containerized configs, and testing.",
        "Implemented responsive UI with TailwindCSS, Framer Motion, and WCAG-compliant patterns."
      ],
      "technologies": [
        "MongoDB",
        "Express",
        "React",
        "Node.js",
        "JWT",
        "Google OAuth",
        "TailwindCSS",
        "Framer Motion"
      ]
    },
    {
  "name": "Resume Tailoring Automation Workflow",
  "summary_short": "Automated multi-stage resume generation pipeline built with n8n, integrating Slack, OpenAI, and GitHub through event-driven orchestration.",
  "repository": "https://github.com/altansaid/resume-updates",
  "description": "A fully autonomous n8n system that listens for job descriptions on Slack, retrieves structured resume data and LaTeX templates, enriches them via OpenAI models, validates and transforms the output, then commits and version-controls results in GitHub. The system operates as a deterministic data pipeline where each node represents a discrete processing stage, ensuring consistent, traceable, and reproducible outcomes.",
  "achievements": [
    "Architected a modular workflow in n8n composed of sequentially linked nodes performing trigger, data retrieval, transformation, AI inference, validation, and persistence operations.",
    "Established a Slack-triggered event source that captures job descriptions in real time and serializes them as primary input for downstream resume tailoring logic.",
    "Configured HTTP Request nodes to dynamically fetch the masterData.json and LaTeX base template, ensuring external data synchronization with versioned sources.",
    "Orchestrated OpenAI model nodes to merge contextual job requirements with structured candidate data, generating refined X–Y–Z quantified achievement statements within strict LaTeX boundaries.",
    "Developed transformation layers using Code nodes (JavaScript) to handle filename generation, metadata normalization, base64 encoding, and JSON serialization for subsequent REST interactions.",
    "Implemented multi-level LaTeX validation logic verifying document integrity — including tag pairing, structure balance, encoding, and symbol escaping — before storage operations.",
    "Integrated authenticated PUT operations through the GitHub REST API to perform atomic commits, guaranteeing version traceability and continuous delivery consistency.",
    "Designed fault-tolerant execution by introducing conditional fallback mechanisms that revert to verified templates upon invalid model outputs, maintaining zero-failure reliability.",
    "Optimized workflow concurrency and state propagation to achieve a fully automated, reproducible pipeline where a single Slack message can produce a validated, version-controlled resume artifact."
  ],
  "technologies": [
    "n8n Workflow Engine",
    "Slack Event Triggers",
    "OpenAI GPT Models",
    "GitHub REST API",
    "HTTP Request Nodes",
    "JavaScript Code Execution",
    "Base64 Encoding & Serialization",
    "LaTeX Document Validation",
    "Automated Commit Operations",
    "Fault-tolerant Pipeline Design"
  ]
},
    {
      "name": "GeekGoose Blog",
      "summary_short": "Laravel Livewire blog with admin panel, SEO, and analytics tracking.",
      "repository": "https://github.com/altansaid/geekgoose",
      "description": "Full-featured blog platform later repurposed for food blogging.",
      "achievements": [
        "Implemented authentication, likes, comments, and admin panel.",
        "Deployed with SEO optimization and analytics tracking."
      ],
      "technologies": ["Laravel", "Livewire", "PHP", "MySQL", "Bootstrap"]
    },
    {
      "name": "Restaurant Review Management System",
      "summary_short": "Full-stack review app built with ASP.NET Core MVC backend and React frontend.",
      "repository": "https://github.com/altansaid/restaurantreviewmanagementsystem",
      "description": "Full-stack review platform using .NET and React with validation and error handling.",
      "achievements": [
        "Developed modular backend in C# with MVC architecture, validation, and error handling.",
        "Built React frontend with dynamic forms using Hooks and Bootstrap 5."
      ],
      "technologies": ["C#", ".NET", "ASP.NET Core", "React", "Bootstrap", "SQL"]
    },
    {
      "name": "Student Registration System",
      "summary_short": "ASP.NET Razor Pages project with validation and grade statistics.",
      "repository": "https://github.com/altansaid/StudentRegistration",
      "description": "ASP.NET Razor Pages app for student course registration with field validation.",
      "achievements": [
        "Implemented form validation and user-friendly error handling.",
        "Added sorting and average grade calculations in the view."
      ],
      "technologies": ["C#", ".NET", "ASP.NET Razor Pages"]
    }
  ],

  "certifications": [
    {
      "name": "Google Analytics 4 Certification",
      "issuer": "Google",
      "date": "2024-07"
    }
  ],

  "achievements_summary": [
    "Developed PLAB2Practice.com serving 500+ active users worldwide.",
    "Improved SEO and accessibility scores to 90+ during Solace internship.",
    "Reduced CI/CD build failures by 80% through Node.js environment optimization."
  ],

  "technical_skills": {
    "languages": ["JavaScript", "TypeScript", "Java", "C#", "PHP", "SQL", "HTML5", "CSS3"],
    "frontend": ["React", "Redux", "TailwindCSS", "Material UI", "Bootstrap", "Responsive Design", "WCAG"],
    "backend": ["Spring Boot", "Node.js", "Express", "ASP.NET Core", "Laravel", "Livewire", "REST APIs", "JWT", "OAuth"],
    "databases": ["PostgreSQL", "MySQL", "MongoDB"],
    "cloud": ["Render", "Vercel", "Netlify", "Google Cloud Platform", "Supabase"],
    "tools": ["Docker", "Git", "Linux CLI", "NVM", "Homebrew"],
    "practices": ["Agile", "Scrum", "CI/CD", "Unit Testing", "Clean Architecture", "Code Reviews"]
  }
}
