{
  "personal_info": {
    "name": "Said Altan",
    "location": "Ottawa, ON, Canada",
    "email": "altansaid13@outlook.com",
    "portfolio": "https://saidaltan.com",
    "github": "https://github.com/altansaid",
    "linkedin": "https://linkedin.com/in/saidaltan"
  },

  "education": [
    {
      "degree": "Diploma in Web Development and Internet Applications",
      "school": "Algonquin College",
      "location": "Ottawa, Canada",
      "graduation_date": "2025-04"
    }
  ],

  "experience": [
    {
      "type": "internship",
      "title": "Web Developer Intern",
      "company": "Solace",
      "location": "Ottawa, Canada",
      "start_date": "2024-09",
      "end_date": "2024-12",
      "description": "Contributed to enhancements across internal and public-facing websites within the Web Marketing team. Assisted in building reusable UI components and custom functionality for WordPress using PHP, JavaScript, and jQuery. Implemented a hierarchical table of contents module that improved navigation through long-form pages, supported by UX observations in Hotjar and Google Analytics. Collaborated with designers and developers to deliver a small HR-focused microsite, participating in layout planning in Figma and development in WordPress. Supported debugging of front-end deployment issues in Gatsby-based environments, learning version compatibility workflows. Participated in performance and accessibility improvements guided by Lighthouse insights, gaining exposure to responsive design, SEO fundamentals, and iterative delivery processes."
    },
    {
      "type": "volunteer_contributor",
      "title": "Software Developer",
      "company": "Arbitrage Cyclops",
      "location": "Remote",
      "start_date": "2025-07",
      "end_date": "present",
      "description": "Contributed to UI improvements for an Amazon arbitrage SaaS platform focused on product sourcing and marketplace comparison. Assisted in redesigning page layouts using React and Tailwind to enhance usability and messaging clarity. Helped introduce scalable list views for large product sets to reduce friction when users browse pricing results. Worked with backend contributors to refine UI behavior and align API consumption patterns. Provided ongoing UX refinements around navigation, feature visibility, and onboarding elements, gaining practical experience in incremental design improvements."
    }
  ],

  "projects": [
    {
      "name": "PLAB2 Practice Platform",
      "summary_short": "Built a full-stack real-time PLAB2 practice app with React, Spring Boot, and WebSockets for 500+ users.",
      "link": "https://plab2practice.com",
      "repository": "https://github.com/altansaid/plab2projectnew",
      "description": "Real-time collaborative platform for medical exam preparation with role-based sessions and feedback.",
      "paragraph": "Designed and built a full-stack real-time web application for PLAB 2 medical exam practice, where users assume Doctor, Patient, and Observer roles in simulated consultations. Implemented authentication, JWT-secured access control, session timers, randomized case generation, and structured feedback flows using Spring Boot with modular REST APIs and WebSocket messaging. Developed the client interface in React, TypeScript, Tailwind, and Material UI with attention to responsive layouts and basic accessibility. Configured PostgreSQL persistence with Flyway migrations and deployed via Render (backend) and Vercel (frontend), supporting 500+ users. Through iterative debugging, scaling, and usability improvements, gained hands-on experience with state synchronization, real-time messaging, UI feedback loops, and container-based deployment."
    },
    {
      "name": "Interview Coach AI",
      "summary_short": "MERN-based AI interview prep platform using Gemini API, JWT, and Google OAuth.",
      "link": "https://interviewcoach-ai.vercel.app/",
      "repository": "https://github.com/altansaid/interviewcoach-ai",
      "description": "AI-powered interview preparation app generating tailored questions with pinning and explanation features.",
      "paragraph": "Developed a MERN-based AI platform that generates personalized interview questions using Google’s Gemini API, enabling users to practice and pin questions as they progress. Built secure authentication including email/password flows, JWT management, Google OAuth integration, and a modal-driven password reset experience to refine UX handling of multi-step states. Implemented core features for note-taking, progress tracking, and image upload through Multer while gaining experience in file handling and form validation. Structured the backend using Express and MVC patterns, deployed frontend on Vercel, and configured hosting for the API. Focused on creating clean, responsive UI components with TailwindCSS and Framer Motion while learning accessibility principles, error handling, and reliability considerations."
    }
  ],

  "technical_skills": {
    "languages": [
      "JavaScript",
      "TypeScript",
      "Java",
      "C#",
      "PHP",
      "SQL",
      "HTML5",
      "CSS3"
    ],
    "frontend": [
      "React",
      "Redux",
      "TailwindCSS",
      "Material UI",
      "Bootstrap",
      "Responsive Design",
      "WCAG"
    ],
    "backend": [
      "Spring Boot",
      "Node.js",
      "Express",
      "ASP.NET Core",
      "Laravel",
      "Livewire",
      "REST APIs",
      "JWT",
      "OAuth"
    ],
    "databases": ["PostgreSQL", "MySQL", "MongoDB"],
    "cloud": [
      "Render",
      "Vercel",
      "Netlify",
      "Google Cloud Platform",
      "Supabase"
    ],
    "tools": ["Docker", "Git", "Linux CLI", "NVM", "Homebrew"],
    "practices": [
      "Agile",
      "Scrum",
      "CI/CD",
      "Unit Testing",
      "Clean Architecture",
      "Code Reviews"
    ]
  }
}
